app/controllers/school_classes_controller.rb

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
  def show
    @class = SchoolClass.find_by(id: params[:id])

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "test class"], ["room_number", 0], ["created_at", "2020-04-25 17:43:42.320237"], ["updated_at", "2020-04-25 17:43:42.320237"]]
---
  def create
    @class = SchoolClass.create(class_params)